[{"id":0,"name":"Story","text":[{"type":"text","body":{"eng":"Centurion ","srb":"Стотинаре "}},{"type":"variable","body":"centurion_name"},{"type":"text","body":{"eng":"! Look what I've found! - said proudly ","srb":"! Погледај шта сам пронашао! - рече поносно "}},{"type":"variable","body":"bannerbearer_name"},{"case":["Game_CTRL.knowledge_laomd_coat_of_arms","==",1],"type":"text","body":{"eng":" the bannerbearer, showing a flag with the coat of arms that you saw at the Chalicier's Head Quarters.## - I've found it while searching the storages. What do you say sire? Should I place it on the roof, show it to the skies?","srb":" барјактар, показујући заставу какву си видео у Пехарниковој главној одаји. ## - Пронашао сам је док смо претраживали складишта. Шта кажеш стотинаре? Да је пободем на кров, принесем је небесима?"}},{"case":["Game_CTRL.knowledge_laomd_coat_of_arms","!=",1],"type":"text","body":{"eng":" the bannerbearer, showing a flag with the coat of arms unknown to you two. But you both realized it clearly. ## -I've found it while searching the storages. What do you say sire? Should I place it on the roof, show it to the skies?","srb":" барјактар, показујући заставу са непознатим грбом. Али јасно сте схватили. ## - Пронашао сам је док смо претраживали складишта. Шта кажеш стотинаре? Да је пободем на кров, принесем је небесима?"}}],"choices":[{"text":{"eng":"To the Skies, and to the Beasts on Earth! Do that, bannerbearer!","srb":"Небесима, и Зверима на Земљи! Учини тако, барјактаре!"},"variables":[{"script":"variable_set_by_string","arguments":["Fort.flag","=","old_fort_flag"]},{"script":"gain_respect","arguments":["king_kiron",1]}],"jump_to_index":1,"timers":[]},{"text":{"eng":"Yes! You should also take one of our banners and set it one by the other.","srb":"Да! Узми такође један наш барјак и пободи их један до другога."},"variables":[{"script":"variable_set_by_string","arguments":["Fort.flag","=","both_flags"]},{"script":"gain_respect","arguments":["king_kiron",1]},{"script":"gain_respect","arguments":["centuria",1]}],"jump_to_index":2,"timers":[]},{"text":{"eng":"We don't even know who's flag it is. The old fort is dead. Place our banner on the roof.","srb":"Не знамо ни чија је то застава. Стара тврђава је мртва. Наш барјак пободи на кров."},"variables":[{"script":"variable_set_by_string","arguments":["Fort.flag","=","centuria_flag"]},{"script":"gain_respect","arguments":["king_kiron",-1]},{"script":"gain_respect","arguments":["centuria",1]}],"jump_to_index":3,"timers":[]}],"next_index":-1,"next_room":""},{"id":1,"name":"Story","text":[{"type":"text","body":{"eng":"To the Skies, and to the Beasts on Earth! Do that, bannerbearer! Let everyone see the fort is alive and still in the hands of the King!","srb":"Небесима и Зверима на Земљи! Учини тако, барјактаре! Нека сви виде да је тврђава жива и чврсто у Краљевим рукама!"}}],"choices":[],"next_index":4,"next_room":""},{"id":2,"name":"Story","text":[{"type":"text","body":{"eng":"Good idea! But take also one of our banners and set them one by the other! Let everyone see the life of the old fort, living with the blood of young centuria!","srb":"Добра идеја! Али узми и један од наших барјака и постави их један до другога! Нека сви виде живот старе тврђаве кроз коју струји крв младе чете!"}}],"choices":[],"next_index":4,"next_room":""},{"id":3,"name":"Story","text":[{"type":"text","body":{"eng":"We don't even know who's flag it is. The old fort is dead... Instead, better place the banner of our centuria on the roof. Let everyone see that we, this centuria, will take all the glory!","srb":"Не знамо ни чија је то застава. Стара тврђава је мртва... Уместо тога, боље постави барјак наше чете на кров. Нека сви виде да ћемо ми - ова чета - освојити сву славу!"}}],"choices":[],"next_index":4,"next_room":""},{"id":4,"name":"Story","text":[{"type":"text","body":{"eng":"Right away! - said ","srb":"Из ових стопа! - рече "}},{"type":"variable","body":"bannerbearer_name"},{"type":"text","body":{"eng":". You could see a smile on his face. You also let one happen after he is gone. You don't know why, but you are optimistic about this hard situation that you and your man are in... ## - But it will be hard as hell - said the inner voice. ##","srb":". Могао си да видиш осмејак на његовом лицу. Дозволио си и да се твојим лицем ослободи један осмех. Не знаш због чега, али имаш неку чврсту веру у добар коначни исход вашег тешког положаја. ## - Али биће тешко као олова рудник - рече унутрашњи глас. ##"}}],"choices":[],"next_index":-2,"next_room":""}]