[{"id":0,"name":"Story","text":[{"type":"text","body":"Centurion "},{"type":"variable","body":"centurion_name"},{"type":"text","body":"! Look what I've found! - said produly "},{"type":"variable","body":"bannerman_name"},{"type":"text","body":" the bannerman, showing the a flag with sigils unknown to you. But you both realized it clearly. ## -I've found it in the first underground room. What do you say sire?"}],"choices":[],"next_index":1,"next_room":""},{"id":1,"name":"Story","text":[{"type":"text","body":"Serving as a centurion of king Kiron I of Rat-Hamad, you have been ordered to lead your centuria to the war torn part of the Kingdom, and to reinforce an old fort that has been standing on thin ice during current barbarian rebelion and ever growing threat of monsters and beasts of the area."}],"choices":[],"next_index":2,"next_room":""},{"id":5,"name":"Story","text":[{"type":"text","body":"Four packs of Psoglavs did their best to eat all of you, but the men stood strong and you have repelled them at the end... But 7 gave their last breath for this small victory, and another 12 are wounded. Heavens know how terrible would the losses be if you weren't behind the damaged walls... But. It is not the time for thinking, but for acting! The men are awaiting your command:"}],"choices":[{"text":"We need to prepare basic defences! Start barricading the chokepoints between the walls!","variables":[{"script":"story_room_arg_respect","arguments":[1]}],"jump_to_index":6,"timers":[{"seconds":15,"variables":[],"jump_to_index":6}]},{"text":"We have enough time to burry our fallen brothers. Then we can prepare defences, and rest.","variables":[],"jump_to_index":7,"timers":[{"seconds":15,"variables":[{"script":"story_room_arg_respect","arguments":[1]}],"jump_to_index":7}]}],"next_index":-1,"next_room":""},{"id":6,"name":"You","text":[{"type":"text","body":"Move the corpses there. First we need to barricade entrances to the fort, and only after will we have the luxury to bury our commrades. Make no mistake - dangers are all around us. We must not put our guards down."}],"choices":[],"next_index":-2,"next_room":"rm_glavna"},{"id":7,"name":"You","text":[{"type":"text","body":"Gather, brothers, to show our last respect to the fallen men... Psoglavs aren't coming back before they lick their wounds. We have plenty of time to bury the men, and prepare for the next battle after that."}],"choices":[],"next_index":-2,"next_room":"rm_glavna"}]